# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
backbone1depth: 2  # layer channel multiple
anchors:
  - [6,12, 16,28, 48,32]  #4

backbone1:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   #320*320*32
   [-1, 3, C3, [64]],  #1
   #320*320*32
  ]

backbone2:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  #3 10-P1/2
   [-1, 3, C3, [64]],  #1
   #320*320*32
   [[-1, 1], 1, Concat2, [1]],  #4
   #320*320*64
   [-1, 3, C3, [64]],
   #320*320*32
   [-1, 1, Conv, [128, 3, 2]], 
   [-1, 3, C3, [128]],
   [-1, 1, SPPF, [128, 5]],  # 8
   #160*160*64
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [64, 1, 1]], #
   #160*160*32
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],#320*320*32
   [[-1, 5], 1, Concat, [1]],  # 320*320*64
   [-1, 1, C3, [128, False]],  # 320*320*64 12

   [[12], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
